:DOC-CONFIG:
#+property: header-args :emacs-lisp :tangle (concat (file-name-sans-extension (buffer-file-name)) ".el")
#+property: header-args :mkdirp yes :comments yes
:END:

#+STARTUP: indent

#+begin_src emacs-lisp :epilogue (format-time-string ";; Last generated on %c")
;;; config.el --- Emacs Core Configuration -*- lexical-binding: t -*-
;;
;; DO NOT EDIT THIS FILE DIRECTLY
;; This is a file generated from a literate programing source file
;; You should make any changes there and regenerate it from Emacs org-mode using C-c C-v t
;;
;; Sources are available from https://github.com/fpdevil/dotemacs
;;
;; Copyright (C) 2023 Sampath Singamsetty
;;
;; Author: Sampath Singamsetty <singamsetty.sampath@gmail.com>
;; Homepage: https://github.com/fpdevil/emacs.d
;;
;; Commentary
;; This is the core configuration powering this Emacs setup and
;; it has all the required bootstrapping information for installing
;; the package managers and initialising them.
;;
;;
;; ------- The following code was auto-tangled from orgmode file. -------
#+end_src

* Loading of the Literate Mode Configurations                              :CFGLST:
Configuration for individual or specific modules, functions, modes and languages

 #+begin_src shell :results replace raw :eval no
for i in `ls modules/*.org`;do echo "- " file:${i}; done
 #+end_src

 #+RESULTS:
 -  file:modules/addons-config.org
 -  file:modules/buffermgmt-config.org
 -  file:modules/color-themes.org
 -  file:modules/company-config.org
 -  file:modules/completion-config.org
 -  file:modules/custom-config.org
 -  file:modules/documentation-config.org
 -  file:modules/eglot-config.org
 -  file:modules/eldoc-config.org
 -  file:modules/flycheck-config.org
 -  file:modules/flyspell-config.org
 -  file:modules/keymapping-config.org
 -  file:modules/lsp-config.org
 -  file:modules/neotree-config.org
 -  file:modules/org-config.org
 -  file:modules/pdftools-config.org
 -  file:modules/presentations-config.org
 -  file:modules/ranbow-config.org
 -  file:modules/yas-config.org

